Revit 2024 API
ConduitSizeSettingIterator.MoveNext Method
 Increments the enumerator to the next item.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public virtual bool MoveNext()
Visual Basic
Public Overridable Function MoveNext As Boolean
Visual C++
public:
virtual bool MoveNext()
Return Value
 True if there is a next available item in this enumerator. False if the enumerator has completed all available items.
See Also
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace